In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

births = pd.read_csv('births.csv')

In [3]:
births.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [9]:
births['decade'] = 10 * (births['year'] // 10)
#기존 데이터에 decade 속성을 추가. 추후 연산은 이걸 기반으로 작동
#births.head()
births.pivot_table('births', index='decade', columns='gender', aggfunc='sum')
#aggfunc sum을 통해 합침

gender         F         M
decade
1960     1753634   1846572
1970    16263075  17121550
1980    18310351  19243452
1990    19479454  20420553
2000    18229309  19106428

In [ ]:
%matplotlib inline
import matplotlib.pyplot as plt
sns.set()
births.pivot_table('births', index='year', columns='gender', aggfunc='sum').plot()
plt.ylabel('total births per year')